---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator
source: html/cbbf8157-44b2-6680-c27f-3dd1a7afbaf8.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator

An iterator to a set of items from DuctSizeSettings. Each item is a KeyValuePair(DuctShape::Enum, DuctSizes).

## Syntax (C#)
```csharp
public class DuctSizeSettingIterator : IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
```